pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_build_binary_code.h
//---------------------------------------------------------------------------*
//                                                                           *
//                     File 'pic18_build_binary_code.h'                      *
//                        Generated by version 2.4.5                         *
//                      june 17th, 2013, at 15h59'41"                        *
//                                                                           *
//---------------------------------------------------------------------------*

//--- START OF USER ZONE 1


//--- END OF USER ZONE 1

#ifndef pic18_build_binary_code_ENTITIES_DEFINED
#define pic18_build_binary_code_ENTITIES_DEFINED

//---------------------------------------------------------------------------*

#include "galgas2/predefined-types.h"

//---------------------------------------------------------------------------*

#include "pic18_intermediate_classes.h"
#include "pic18_mnemonics.h"
#include "pic18_metamodel.h"
#include "generic_metamodel.h"
#include "intermediate_generic.h"
#include "piccoloDevice_semantics.h"
#include "pic18_build_assembly_code.h"
#include "piccolo_embedded_devices.h"

//---------------------------------------------------------------------------*

class GALGAS_pic_31__38__5F_intermediate_5F_symbolTable ;
class GALGAS_emittedCodeList ;
class GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element ;
class GALGAS_emittedCodeList_2E_element ;

//---------------------------------------------------------------------------*
//                                                                           *
//                    @pic18_intermediate_symbolTable map                    *
//                                                                           *
//---------------------------------------------------------------------------*

class cMapElement_pic_31__38__5F_intermediate_5F_symbolTable ;

//---------------------------------------------------------------------------*

extern const char * kSearchErrorMessage_pic_31__38__5F_intermediate_5F_symbolTable_searchKey ;

//---------------------------------------------------------------------------*

class GALGAS_pic_31__38__5F_intermediate_5F_symbolTable : public AC_GALGAS_map {
//--------------------------------- Default constructor
  public : GALGAS_pic_31__38__5F_intermediate_5F_symbolTable (void) ;

//--------------------------------- Handle copy
  public : GALGAS_pic_31__38__5F_intermediate_5F_symbolTable (const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable & inSource) ;
  public : GALGAS_pic_31__38__5F_intermediate_5F_symbolTable & operator = (const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable & inSource) ;

//-- Start of generic part --*

//--------------------------------- Object cloning
  protected : virtual AC_GALGAS_root * clonedObject (void) const ;

//--------------------------------- Object extraction
  public : static GALGAS_pic_31__38__5F_intermediate_5F_symbolTable extractObject (const GALGAS_object & inObject,
                                                                                   C_Compiler * inCompiler,
                                                                                   const GALGAS_location & inErrorLocation
                                                                                   COMMA_LOCATION_ARGS) ;

//--------------------------------- GALGAS constructors
  public : static GALGAS_pic_31__38__5F_intermediate_5F_symbolTable constructor_emptyMap (LOCATION_ARGS) ;

  public : static GALGAS_pic_31__38__5F_intermediate_5F_symbolTable constructor_mapWithMapToOverride (const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable & inOperand0
                                                                                                      COMMA_LOCATION_ARGS) ;


//--------------------------------- Modifiers
  public : VIRTUAL_IN_DEBUG void modifier_insertKey (GALGAS_lstring constinArgument0,
                                                     GALGAS_uint constinArgument1,
                                                     C_Compiler * inCompiler
                                                     COMMA_LOCATION_ARGS) ;

  public : VIRTUAL_IN_DEBUG void modifier_setMSymbolAddressForKey (GALGAS_uint constinArgument0,
                                                                   GALGAS_string constinArgument1,
                                                                   C_Compiler * inCompiler
                                                                   COMMA_LOCATION_ARGS) ;


//--------------------------------- Instance Methods
  public : VIRTUAL_IN_DEBUG void method_searchKey (GALGAS_lstring constinArgument0,
                                                   GALGAS_uint & outArgument1,
                                                   C_Compiler * inCompiler
                                                   COMMA_LOCATION_ARGS) const ;

//--------------------------------- Class Methods

//--------------------------------- Readers
  public : VIRTUAL_IN_DEBUG GALGAS_uint reader_mSymbolAddressForKey (const GALGAS_string & constinOperand0,
                                                                     C_Compiler * inCompiler
                                                                     COMMA_LOCATION_ARGS) const ;

  public : VIRTUAL_IN_DEBUG GALGAS_pic_31__38__5F_intermediate_5F_symbolTable reader_overriddenMap (LOCATION_ARGS) const ;


//--------------------------------- Introspection
  public : VIRTUAL_IN_DEBUG const C_galgas_type_descriptor * staticTypeDescriptor (void) const ;
//--------------------------------- 'with' accessors
  public : VIRTUAL_IN_DEBUG cMapElement_pic_31__38__5F_intermediate_5F_symbolTable * readWriteAccessForWithInstruction_hasKey (C_Compiler * inCompiler,
                                                                                                                               const GALGAS_string & inKey
                                                                                                                               COMMA_LOCATION_ARGS) ;

  public : VIRTUAL_IN_DEBUG cMapElement_pic_31__38__5F_intermediate_5F_symbolTable * readWriteAccessForWithInstruction_searchKey (C_Compiler * inCompiler,
                                                                                                                                  const GALGAS_lstring & inKey
                                                                                                                                  COMMA_LOCATION_ARGS) ;

//--------------------------------- Friend

