pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_build_binary_code.h
  friend class cEnumerator_pic_31__38__5F_intermediate_5F_symbolTable ;
 
} ; // End of GALGAS_pic_31__38__5F_intermediate_5F_symbolTable class

//---------------------------------------------------------------------------*
//   Enumerator declaration                                                  *
//---------------------------------------------------------------------------*

class cEnumerator_pic_31__38__5F_intermediate_5F_symbolTable : public cGenericAbstractEnumerator {
  public : cEnumerator_pic_31__38__5F_intermediate_5F_symbolTable (const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable & inEnumeratedObject,
                                                                   const typeEnumerationOrder inOrder) ;

//--- Current element access
  public : GALGAS_lstring current_lkey (LOCATION_ARGS) const ;
  public : GALGAS_uint current_mSymbolAddress (LOCATION_ARGS) const ;
//--- Current element access
  public : GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element current (LOCATION_ARGS) const ;
} ;

//---------------------------------------------------------------------------*

extern const C_galgas_type_descriptor kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_symbolTable ;

//--------------------------------- 'with' accessors
cCollectionElement * readWriteAccessForWithInstruction_hasKey (C_Compiler * inCompiler,
                                                               GALGAS_pic_31__38__5F_intermediate_5F_symbolTable & ioMap,
                                                               GALGAS_string & inKey
                                                               COMMA_LOCATION_ARGS) ;

cCollectionElement * readWriteAccessForWithInstruction_searchKey (C_Compiler * inCompiler,
                                                                  GALGAS_pic_31__38__5F_intermediate_5F_symbolTable & ioMap,
                                                                  GALGAS_lstring & inKey
                                                                  COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//                           @emittedCodeList list                           *
//                                                                           *
//---------------------------------------------------------------------------*

class GALGAS_emittedCodeList : public AC_GALGAS_list {
//--------------------------------- Default constructor
  public : GALGAS_emittedCodeList (void) ;

//--------------------------------- List constructor used by listmap
  public : GALGAS_emittedCodeList (cSharedList * inSharedListPtr) ;

//--------------------------------- Element constructor used by listmap
  public : static void makeAttributesFromObjects (capCollectionElement & outAttributes,
                                                  const GALGAS_uintlist & in_mCode
                                                  COMMA_LOCATION_ARGS) ;

//-- Start of generic part --*

//--------------------------------- Object cloning
  protected : virtual AC_GALGAS_root * clonedObject (void) const ;

//--------------------------------- Object extraction
  public : static GALGAS_emittedCodeList extractObject (const GALGAS_object & inObject,
                                                        C_Compiler * inCompiler,
                                                        const GALGAS_location & inErrorLocation
                                                        COMMA_LOCATION_ARGS) ;

//--------------------------------- GALGAS constructors
  public : static GALGAS_emittedCodeList constructor_emptyList (LOCATION_ARGS) ;

  public : static GALGAS_emittedCodeList constructor_listWithValue (const GALGAS_uintlist & inOperand0
                                                                    COMMA_LOCATION_ARGS) ;

//--------------------------------- .= operator
  public : VIRTUAL_IN_DEBUG void dotAssign_operation (const GALGAS_emittedCodeList inOperand
                                                      COMMA_LOCATION_ARGS) ;

//--------------------------------- += operator
  public : VIRTUAL_IN_DEBUG void addAssign_operation (const GALGAS_uintlist & inOperand0
                                                      COMMA_LOCATION_ARGS) ;
//--------------------------------- . (concat) operator
  public : VIRTUAL_IN_DEBUG GALGAS_emittedCodeList operator_concat (const GALGAS_emittedCodeList & inOperand
                                                                    COMMA_LOCATION_ARGS) const ;


//--------------------------------- Modifiers
  public : VIRTUAL_IN_DEBUG void modifier_popFirst (GALGAS_uintlist & outArgument0,
                                                    C_Compiler * inCompiler
                                                    COMMA_LOCATION_ARGS) ;

  public : VIRTUAL_IN_DEBUG void modifier_popLast (GALGAS_uintlist & outArgument0,
                                                   C_Compiler * inCompiler
                                                   COMMA_LOCATION_ARGS) ;

  public : VIRTUAL_IN_DEBUG void modifier_prependValue (GALGAS_uintlist constinArgument0
                                                        COMMA_LOCATION_ARGS) ;


//--------------------------------- Instance Methods
  public : VIRTUAL_IN_DEBUG void method_first (GALGAS_uintlist & outArgument0,
                                               C_Compiler * inCompiler
                                               COMMA_LOCATION_ARGS) const ;

  public : VIRTUAL_IN_DEBUG void method_last (GALGAS_uintlist & outArgument0,
                                              C_Compiler * inCompiler
                                              COMMA_LOCATION_ARGS) const ;

//--------------------------------- Class Methods

//--------------------------------- Readers
  public : VIRTUAL_IN_DEBUG GALGAS_uintlist reader_mCodeAtIndex (const GALGAS_uint & constinOperand0,
                                                                 C_Compiler * inCompiler
                                                                 COMMA_LOCATION_ARGS) const ;

  public : VIRTUAL_IN_DEBUG GALGAS_emittedCodeList reader_subListFromIndex (const GALGAS_uint & constinOperand0,
                                                                            C_Compiler * inCompiler
                                                                            COMMA_LOCATION_ARGS) const ;

  public : VIRTUAL_IN_DEBUG GALGAS_emittedCodeList reader_subListWithRange (const GALGAS_range & constinOperand0,
                                                                            C_Compiler * inCompiler
                                                                            COMMA_LOCATION_ARGS) const ;


//--------------------------------- Introspection
  public : VIRTUAL_IN_DEBUG const C_galgas_type_descriptor * staticTypeDescriptor (void) const ;
//--------------------------------- Friend

