pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_build_binary_code.h
  friend class cEnumerator_emittedCodeList ;
 
} ; // End of GALGAS_emittedCodeList class

//---------------------------------------------------------------------------*
//   Enumerator declaration                                                  *
//---------------------------------------------------------------------------*

class cEnumerator_emittedCodeList : public cGenericAbstractEnumerator {
  public : cEnumerator_emittedCodeList (const GALGAS_emittedCodeList & inEnumeratedObject,
                                        const typeEnumerationOrder inOrder) ;

//--- Current element access
  public : GALGAS_uintlist current_mCode (LOCATION_ARGS) const ;
//--- Current element access
  public : GALGAS_emittedCodeList_2E_element current (LOCATION_ARGS) const ;
} ;

//---------------------------------------------------------------------------*

extern const C_galgas_type_descriptor kTypeDescriptor_GALGAS_emittedCodeList ;

//---------------------------------------------------------------------------*
//                                                                           *
//                         Routine 'getBccBaseCode'                          *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_getBccBaseCode (const GALGAS_conditional_5F_branch constinArgument0,
                             GALGAS_uint & outArgument1,
                             C_Compiler * inCompiler
                             COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//                Routine 'emitConditionalBranchInstruction'                 *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_emitConditionalBranchInstruction (const GALGAS_uint constinArgument0,
                                               const GALGAS_uint constinArgument1,
                                               const GALGAS_location constinArgument2,
                                               const GALGAS_conditional_5F_branch constinArgument3,
                                               GALGAS_emittedCodeList & ioArgument4,
                                               C_Compiler * inCompiler
                                               COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//                       Routine 'emitBRAinstruction'                        *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_emitBRAinstruction (const GALGAS_uint constinArgument0,
                                 const GALGAS_uint constinArgument1,
                                 const GALGAS_location constinArgument2,
                                 GALGAS_emittedCodeList & ioArgument3,
                                 C_Compiler * inCompiler
                                 COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//                   Routine 'emit_pic18_GOTOinstruction'                    *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_emit_5F_pic_31__38__5F_GOTOinstruction (const GALGAS_uint constinArgument0,
                                                     GALGAS_emittedCodeList & ioArgument1,
                                                     C_Compiler * inCompiler
                                                     COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//                   Routine 'emit_pic18_CALLinstruction'                    *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_emit_5F_pic_31__38__5F_CALLinstruction (const GALGAS_uint constinArgument0,
                                                     GALGAS_emittedCodeList & ioArgument1,
                                                     C_Compiler * inCompiler
                                                     COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//                      Routine 'emitRCALLinstruction'                       *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_emitRCALLinstruction (const GALGAS_uint constinArgument0,
                                   const GALGAS_uint constinArgument1,
                                   const GALGAS_lstring constinArgument2,
                                   GALGAS_emittedCodeList & ioArgument3,
                                   C_Compiler * inCompiler
                                   COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//              Routine 'build_pic18_intermediate_binary_code'               *
//                                                                           *
//---------------------------------------------------------------------------*

