pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_build_binary_code.h
void routine_build_5F_pic_31__38__5F_intermediate_5F_binary_5F_code (const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constinArgument0,
                                                                     const GALGAS_uint constinArgument1,
                                                                     const GALGAS_actualConfigurationMap constinArgument2,
                                                                     GALGAS_uint & outArgument3,
                                                                     C_Compiler * inCompiler
                                                                     COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//   Category method '@pic18_intermediate_instruction enterLabelAtAddress'   *
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_enterLabelAtAddress) (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                        GALGAS_pic_31__38__5F_intermediate_5F_symbolTable & ioArgument0,
                                                                                                        GALGAS_uint & ioArgument1,
                                                                                                        C_Compiler * inCompiler
                                                                                                        COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_enterLabelAtAddress (const PMSInt32 inClassIndex,
                                              categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_enterLabelAtAddress inMethod) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_enterLabelAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                             GALGAS_pic_31__38__5F_intermediate_5F_symbolTable & io_ioRoutineSymbolTable,
                                             GALGAS_uint & io_ioAddress,
                                             C_Compiler * inCompiler
                                             COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Abstract category method '@pic18_intermediate_instruction generateBinaryCodeAtAddress'*
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_generateBinaryCodeAtAddress) (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                                const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable constinArgument0,
                                                                                                                GALGAS_uint & ioArgument1,
                                                                                                                GALGAS_emittedCodeList & ioArgument2,
                                                                                                                C_Compiler * inCompiler
                                                                                                                COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_generateBinaryCodeAtAddress (const PMSInt32 inClassIndex,
                                                      categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_generateBinaryCodeAtAddress inMethod) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_generateBinaryCodeAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                     const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable constin_inRoutineSymbolTable,
                                                     GALGAS_uint & io_ioAddress,
                                                     GALGAS_emittedCodeList & io_ioCode,
                                                     C_Compiler * inCompiler
                                                     COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//       @pic_31__38__5F_intermediate_5F_symbolTable_2E_element struct       *
//                                                                           *
//---------------------------------------------------------------------------*

class GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element : public AC_GALGAS_root {
//--------------------------------- Public data members
  public : GALGAS_lstring mAttribute_lkey ;
  public : GALGAS_uint mAttribute_mSymbolAddress ;


//--------------------------------- Accessors
  public : VIRTUAL_IN_DEBUG bool isValid (void) const ;
  public : VIRTUAL_IN_DEBUG void drop (void) ;

//--------------------------------- Default constructor
  public : GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element (void) ;

//--------------------------------- Virtual destructor (in debug mode)
  public : VIRTUAL_IN_DEBUG ~ GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element (void) ;

//--------------------------------- Native constructor
  public : GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element (const GALGAS_lstring & in_lkey,
                                                                         const GALGAS_uint & in_mSymbolAddress) ;

