pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_build_binary_code.h
//-- Start of generic part --*

//--------------------------------- Object cloning
  protected : virtual AC_GALGAS_root * clonedObject (void) const ;

//--------------------------------- Object extraction
  public : static GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element extractObject (const GALGAS_object & inObject,
                                                                                              C_Compiler * inCompiler,
                                                                                              const GALGAS_location & inErrorLocation
                                                                                              COMMA_LOCATION_ARGS) ;

//--------------------------------- GALGAS constructors
  public : static GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element constructor_new (const GALGAS_lstring & inOperand0,
                                                                                                const GALGAS_uint & inOperand1
                                                                                                COMMA_LOCATION_ARGS) ;

//--------------------------------- Implementation of reader 'description'
  public : VIRTUAL_IN_DEBUG void description (C_String & ioString,
                                              const PMSInt32 inIndentation) const ;
//--------------------------------- Comparison
  public : typeComparisonResult objectCompare (const GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element & inOperand) const ;

//--------------------------------- Modifiers

//--------------------------------- Instance Methods
//--------------------------------- Class Methods

//--------------------------------- Readers
  public : VIRTUAL_IN_DEBUG GALGAS_lstring reader_lkey (LOCATION_ARGS) const ;

  public : VIRTUAL_IN_DEBUG GALGAS_uint reader_mSymbolAddress (LOCATION_ARGS) const ;


//--------------------------------- Introspection
  public : VIRTUAL_IN_DEBUG const C_galgas_type_descriptor * staticTypeDescriptor (void) const ;
 
} ; // End of GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element class


//---------------------------------------------------------------------------*

extern const C_galgas_type_descriptor kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_symbolTable_2E_element ;

//---------------------------------------------------------------------------*
//                                                                           *
//                    @emittedCodeList_2E_element struct                     *
//                                                                           *
//---------------------------------------------------------------------------*

class GALGAS_emittedCodeList_2E_element : public AC_GALGAS_root {
//--------------------------------- Public data members
  public : GALGAS_uintlist mAttribute_mCode ;


//--------------------------------- Accessors
  public : VIRTUAL_IN_DEBUG bool isValid (void) const ;
  public : VIRTUAL_IN_DEBUG void drop (void) ;

//--------------------------------- Default constructor
  public : GALGAS_emittedCodeList_2E_element (void) ;

//--------------------------------- Virtual destructor (in debug mode)
  public : VIRTUAL_IN_DEBUG ~ GALGAS_emittedCodeList_2E_element (void) ;

//--------------------------------- Native constructor
  public : GALGAS_emittedCodeList_2E_element (const GALGAS_uintlist & in_mCode) ;

//-- Start of generic part --*

//--------------------------------- Object cloning
  protected : virtual AC_GALGAS_root * clonedObject (void) const ;

//--------------------------------- Object extraction
  public : static GALGAS_emittedCodeList_2E_element extractObject (const GALGAS_object & inObject,
                                                                   C_Compiler * inCompiler,
                                                                   const GALGAS_location & inErrorLocation
                                                                   COMMA_LOCATION_ARGS) ;

//--------------------------------- GALGAS constructors
  public : static GALGAS_emittedCodeList_2E_element constructor_new (const GALGAS_uintlist & inOperand0
                                                                     COMMA_LOCATION_ARGS) ;

//--------------------------------- Implementation of reader 'description'
  public : VIRTUAL_IN_DEBUG void description (C_String & ioString,
                                              const PMSInt32 inIndentation) const ;
//--------------------------------- Comparison
  public : typeComparisonResult objectCompare (const GALGAS_emittedCodeList_2E_element & inOperand) const ;

//--------------------------------- Modifiers

//--------------------------------- Instance Methods
//--------------------------------- Class Methods

//--------------------------------- Readers
  public : VIRTUAL_IN_DEBUG GALGAS_uintlist reader_mCode (LOCATION_ARGS) const ;


//--------------------------------- Introspection
  public : VIRTUAL_IN_DEBUG const C_galgas_type_descriptor * staticTypeDescriptor (void) const ;
 
} ; // End of GALGAS_emittedCodeList_2E_element class


//---------------------------------------------------------------------------*

extern const C_galgas_type_descriptor kTypeDescriptor_GALGAS_emittedCodeList_2E_element ;

//---------------------------------------------------------------------------*
//                                                                           *
//        Class for element of '@pic18_intermediate_symbolTable' map         *
//                                                                           *
//---------------------------------------------------------------------------*

class cMapElement_pic_31__38__5F_intermediate_5F_symbolTable : public cMapElement {
//--- Map attributes
  public : GALGAS_uint mAttribute_mSymbolAddress ;

//--- Constructor
  public : cMapElement_pic_31__38__5F_intermediate_5F_symbolTable (const GALGAS_lstring & inKey,
                                                                   const GALGAS_uint & in_mSymbolAddress
                                                                   COMMA_LOCATION_ARGS) ;

//--- Virtual method for comparing elements
  public : virtual typeComparisonResult compare (const cCollectionElement * inOperand) const ;

//--- Virtual method that checks that all attributes are valid
  public : virtual bool isValid (void) const ;

//--- Virtual method that returns a copy of current object
  public : virtual cMapElement * copy (void) ;

//--- Description
 public : virtual void description (C_String & ioString, const PMSInt32 inIndentation) const ;
} ;

//--- START OF USER ZONE 2


//--- END OF USER ZONE 2

#endif
